## Exploring EMP and DEPT Tables
Check the structure and row count of EMP and DEPT tables.

In [ ]:
DESC emp;

In [ ]:
SELECT * FROM emp;

In [ ]:
SELECT COUNT(*) FROM emp;

In [ ]:
DESC dept;

In [ ]:
SELECT * FROM dept;

In [ ]:
SELECT COUNT(*) FROM dept;

## Cartesian Join
Joining EMP and DEPT without a condition returns every possible combination of rows.

In [ ]:
SELECT ename, sal, dname, loc FROM emp, dept;

##  Cross Join
Ansi Cross Join

SELECT 
    e.empno,
    e.ename,
    d.deptno,
    d.dname
FROM emp AS e
CROSS JOIN dept AS d;

## Ambiguous Column Reference

In [ ]:
SELECT ename, sal, deptno, dname, loc FROM emp, dept; -- Fails

In [ ]:
SELECT ename, sal, dept.deptno, dname, loc FROM emp, dept;

## Using Aliases
Aliases make queries shorter and clearer.

In [ ]:
SELECT e.ename, e.sal, d.deptno, d.dname, d.loc FROM emp e, dept d;

## Equi Join / Inner Join
Select employees with their departments where DEPTNO matches.

In [ ]:
SELECT e.ename, e.sal, d.deptno, d.dname, d.loc FROM emp e, dept d WHERE e.deptno = d.deptno;

In [ ]:
SELECT e.ename, e.sal, d.deptno, d.dname, d.loc FROM emp e JOIN dept d ON e.deptno = d.deptno;

## Employees in Chicago
Select employees who work in Chicago.

In [ ]:
SELECT e.ename, d.loc FROM emp e JOIN dept d ON e.deptno = d.deptno WHERE d.loc = 'CHICAGO';

## Employee - Manager Relationship
Use a self join on EMP to display employee name and their manager name.

In [ ]:
SELECT e1.ename AS employee, e2.ename AS manager FROM emp e1 JOIN emp e2 ON e1.mgr = e2.empno;

Select employees whose salary is higher than their managers.

In [ ]:
SELECT e1.ename AS employee_name, e1.sal AS employee_salary,
       e2.ename AS manager_name, e2.sal AS manager_salary 
FROM emp e1
JOIN emp e2 ON e1.mgr = e2.empno
WHERE e1.sal > e2.sal;

### Employees Above Average Salary
Compare salaries against the average salary using *subqueries*.

In [ ]:
SELECT AVG(sal) FROM emp;

In [ ]:
SELECT * FROM emp WHERE sal > (SELECT AVG(sal) FROM emp);

In [ ]:
SELECT e.ename, e.sal
FROM emp e
JOIN (SELECT AVG(sal) AS avg_sal FROM emp) a
  ON e.sal > a.avg_sal;

## Non-Equi Joins and Outer Joins with Sample Tables
Create sample tables T1 and T2 to demonstrate join types.

In [ ]:
CREATE TABLE t1(a VARCHAR(10), b VARCHAR(10), c VARCHAR(10));
INSERT INTO t1 VALUES('x', 'y', 'z');
INSERT INTO t1 VALUES('p', 'q', 'r');

CREATE TABLE t2(a VARCHAR(10), b VARCHAR(10));
INSERT INTO t2 VALUES('x', 'y');
INSERT INTO t2 VALUES('u', 'v');

In [ ]:
SELECT * FROM t1;

In [ ]:
SELECT * FROM t2;

## Inner Join
Return only rows with matching values in both tables.

In [ ]:
SELECT * FROM t1 JOIN t2 ON t1.a = t2.a;

## Left Join
Return all rows from T1 and matching rows from T2.

In [ ]:
SELECT * FROM t1 LEFT JOIN t2 ON t1.a = t2.a;

## Left Outer Join
Same as LEFT JOIN, explicitly using the OUTER keyword.

In [ ]:
SELECT * FROM t1 LEFT OUTER JOIN t2 ON t1.a = t2.a;

## Right Join
Return all rows from T2 and matching rows from T1.

In [ ]:
SELECT * FROM t1 RIGHT JOIN t2 ON t1.a = t2.a;

## Right Outer Join
Same as RIGHT JOIN, explicitly using the OUTER keyword.

In [ ]:
SELECT * FROM t1 RIGHT OUTER JOIN t2 ON t1.a = t2.a;

## Full Join
Return rows when there is a match in either table.

In [ ]:
SELECT * FROM t1 FULL JOIN t2 ON t1.a = t2.a; -- Might fail on MySQL

In [ ]:
SELECT *
FROM t1
LEFT JOIN t2 ON t1.a = t2.a

UNION

SELECT *
FROM t1
RIGHT JOIN t2 ON t1.a = t2.a;

# Inline Views and ROWNUM

In [ ]:
SELECT ename, sal, sal*12 annual_salary FROM emp WHERE annual_salary > 30000;

### ROWNUM Basics
ROWNUM generates sequential numbers for rows in the result set.

In [ ]:
SELECT 
    ROW_NUMBER() OVER (ORDER BY ename) AS rownum,
    ename
FROM emp;

Assigns a unique, sequential number to each row regardless of ties

SELECT 
    ROW_NUMBER() OVER (ORDER BY sal) AS rownum,
    sal, ename
FROM emp;

Ranks with gaps after ties. Tied values get the same rank, and the next rank is skipped.

In [ ]:
SELECT 
    RANK() OVER (ORDER BY sal) AS rownum,
    sal, ename
FROM emp;

Ranks without gaps. Tied values get the same rank, and the next rank is consecutive

In [ ]:
SELECT 
    DENSE_RANK() OVER (ORDER BY sal) AS rownum,
    sal, ename
FROM emp;